#!/bin/bash

printf "\e[8;50;53t" &&
echo "
█████████████████████████████████████████████████████
█████████████████████▛▛▛▛▟▙▙▙▙▙▙▌▀▘        ▀▀▜███████
█ ꜱᴄʀɪᴘᴛ ᴅᴇ █████▛▛▙▙▜▜▜▜▙▙▙▙▙▛▟            ▄▄▄▛█████
███████████████▜▚▛▛▟▞▛▛▛▙▙▙▙▙▙█▙           █▛█▜█▜████
█████████████▜▞▛▙▜▜▚▛▛▛█▟▟▟▟▟▚▙▛▖          ▛███▜█▜███
███████████▛▙▜▞▛▟▜▚▛▛▛▛▟▟▟▟▟▟▜▙▛▙          ▜█▟▛███▜▞█
██████████▜▟▞▙▜▜▞▙▛▛▟▜▜▚▙▙▙▙▛█▞▛▙▖          ▚███▟▛█▌▜
█████████▜▚▚▜▞▛▟▜▟▞▛▙▛▛█▟▟▟▟▜▟▜▛█▟▖          ▀▟▛▙██ ▐
████████▙▜▞▛▙▜▞▙▙▙▜▜▞▛▛▟▟▟▟▟▜▟▜▜▟▚▛▖           ▝▀▀   
███████▘▚▙▜▟▞▙▜▟▞▟▜▚▛▛▛▙▙▙▙▛█▟▛█▟▛▛▙▖               
██████▛▝▐▞▙▚▜▞▙▙▜▞▛▛▟▜▜▟▟▟▞█▟▟▜▙▙▛█▜▟▄              ▐
██████▘▚ ▛▞▛▙▜▞▞▙▛▛▟▜▜▙▙▙▙▛▙▙▛▙▙▛▛▙▛▙▛▌▖            ▟
█████▛▝▗▝▐▜▟▞▙▜▜▟▞▛▛▛▙▙▙▙▙▛▙▙▛█▟▜▜▙█▙▛█▜▄          ▞█
█████▌▚▗▝ ▙▚▜▞▛▙▙▜▜▜▟▚▙▙▙▙▛▙▛▛▙▛▛█▟▟▞█▟▜▟▟▄       ▞▛█
█████▘▖▗▝▗▝▛▙▜▟▞▟▜▚▛▟▜▟▟▟▞▛▙▛█▙▛█▚▙▙▛▙▛█▟▟▟▟▄▖ ▗▗▙▜▜█
█████▗ ▘▖▘▖▞▟▚▙▜▞▙▛▛▙█▟▟▞▛▛▙█▙▙▛▛▛▙▛▛▙█▟▟▟▟▟▟▟▜▟▜▟▜▜█
█████▗▝▗▗▗▗▝▝▙▙▜▜▞▛▟▙▙▙▙▛▛█▜▟▟▟▜▛█▙▛▛▙▙▙▙▙▙▙▙▜▜▟▜▟▜██
████▌▘▗▝ ▖▝▗▚▗▘▌▞▛▙▙▜▟▟▞█▜▟▟▙█▙█▜▟▟▜▟▜▜▟▚▙▙▙▛▛█▞█▞███
████▌▘▖▗▝▝▗▝▐▝▖▖▌▞▞▞▜▚▛▙▜▜▟▜▙▛▟▜▟▟▜▜▟▜▟▛▟▜▙▙█▞█▞▛▟███
████▌▖▗ ▖▘▗▝▖▌▚▚▐▝▞▞▌▌▀▀▜▜▟▜▟▜▜▜▟▜▜▜▟▛▙▛▙█▟▟▞█▞██████
████ ▖▗ ▖▗▗▝▞▖▚▝▖▌▞▖▌▚▚▘▌▌▌▌▌▞▞▞▞▗▘▀▀▀▗▗ ▖ ▗▝▟███████
████ ▖ ▖▗ ▗▚▗▐▝▞▝▖▚▐▝▞ ▘▘▘▘▗▗▗▗▗▗▗▝ ▘▖▖▖▘▖▚▄█████████
███▌▖ ▘ ▖▝▖▞▖▘▚▝▝▝▗ ▖ ▘▘▝ ▘▖▗ ▖▗ ▖▝▝▗▗▗▗▙▟███████████
███▌ ▖▖▘ ▖▞ ▝▝ ▖▘▝ ▖ ▘▝ ▘▘▘▗▗▗▗▗▗ ▚▐▄▟███████████████
███ ▖  ▗ ▖ ▝ ▖▘ ▖▘▗ ▘▘▘▘▝▗▝ ▖▗▗▄▄████████████████████
██▛ ▗▝ ▖ ▗▝ ▘ ▗ ▗▝ ▗▗▗▗▝▗▄▄▙█████████████████████████
██▌▝  ▗ ▝  ▖ ▘▗▝ ▗▟▄▄▟███████████████████████████████
██  ▖▝  ▖ ▘ ▙▟▟██████████████████████████████████████
█▌ ▘  ▖▙▄███████████████████████ ʟᴀᴄᴀᴘꜱᴜʟᴇ.ᴏʀɢ ██████
█  ▄▄████████████████████████████████████████████████
▙▟███████████████████████████████████████████████████" &&
echo "" &&
sleep 1 &&

echo "" 
echo "         $(tput setaf 0)$(tput setab 9) Début du script d'installation... $(tput sgr0)" &&
sleep 1 &&

echo ""
echo "        $(tput setaf 0)$(tput setab 9) Mise à jour de la liste des paquets $(tput sgr0)" &&
sleep 1 &&

echo ""
echo ""
echo ""
echo " $(tput setaf 0)$(tput setab 9) Veuillez entrer votre mot de passe administrateur $(tput sgr0)" &&
echo ""
sleep 1 &&

sudo apt update

echo ""
echo "                      ✅ OK ✅" &&
sleep 0.5 &&

echo ""
echo "          $(tput setaf 0)$(tput setab 9) Installation du terminal GNOME $(tput sgr0)" &&
echo ""
sleep 1 &&

apt install gnome-terminal -y

echo ""
echo "                      ✅ OK ✅" &&
sleep 0.5 &&

echo ""
echo "         $(tput setaf 0)$(tput setab 9) Installation des nouveaux paquets $(tput sgr0)" &&
echo ""
sleep 1 &&

sudo apt upgrade -y

echo ""
echo "                      ✅ OK ✅" &&
sleep 0.5 &&

echo ""
echo "          $(tput setaf 0)$(tput setab 9) Installation de l'éditeur GEDIT $(tput sgr0)" &&
echo ""
sleep 1 &&

apt install gedit -y

echo ""
echo "                      ✅ OK ✅" &&
sleep 0.5 &&

echo ""
echo "     $(tput setaf 0)$(tput setab 9) Installation de l'outil de versioning GIT $(tput sgr0)" &&
echo ""
sleep 1 &&

apt install git -y

echo ""
echo "                      ✅ OK ✅" &&
sleep 0.5 &&

echo ""
echo "     $(tput setaf 0)$(tput setab 9) Installation de l'outil de monitoring HTOP $(tput sgr0)" &&
echo ""
sleep 1 &&

apt install htop -y

echo ""
echo "                      ✅ OK ✅" &&
sleep 0.5 &&

echo ""
echo "           $(tput setaf 0)$(tput setab 9) Installation des dependances $(tput sgr0)" &&
echo ""
sleep 1 &&

apt install software-properties-common -y &&
add-apt-repository ppa:wireshark-dev/stable -y &&

echo ""
echo "                      ✅ OK ✅" &&
sleep 0.5 &&

echo ""
echo "            $(tput setaf 0)$(tput setab 9) Installation de Wireshark $(tput sgr0)" &&
echo ""
sleep 1 &&
 
apt install wireshark -y &&

echo ""
echo "                      ✅ OK ✅" &&
sleep 0.5 &&

echo ""
echo "             $(tput setaf 0)$(tput setab 9) Installation de Hardinfo $(tput sgr0)" &&
echo ""
sleep 1 &&

apt install hardinfo -y

echo ""
echo "                      ✅ OK ✅" &&
sleep 0.5 &&

echo ""
echo "             $(tput setaf 0)$(tput setab 9) Installation de Sysbench $(tput sgr0)" &&
echo ""
sleep 1 &&

apt install sysbench -y

echo ""
echo "                      ✅ OK ✅" &&
sleep 0.5 &&

echo ""
echo "              $(tput setaf 0)$(tput setab 9) Installation de S-Tui $(tput sgr0)" &&
echo ""
sleep 1 &&

apt install s-tui stress -y

echo ""
echo "                      ✅ OK ✅" &&
sleep 0.5 &&

echo ""
echo "            $(tput setaf 0)$(tput setab 9) Installation de Distroshare $(tput sgr0)" &&
echo ""
sleep 1 &&

cd /home/$USER/ &&
sudo git clone https://github.com/Distroshare/distroshare-ubuntu-imager.git &&

echo ""
echo "                      ✅ OK ✅" &&
sleep 0.5 &&

echo ""
echo ""
echo ""
echo "    $(tput setaf 1)$(tput setab 7) L'installation a été effectuée avec succès $(tput sgr0)" &&
sleep 0.5 &&

echo ""
echo ""
echo "                       👍👍👍"
sleep 4.5 &&
echo ""
echo ""
