#!/bin/bash

printf "\e[8;50;53t" &&
echo "
█████████████████████████████████████████████████████
█████████████████████▛▛▛▛▟▙▙▙▙▙▙▌▀▘        ▀▀▜███████
█ ꜱᴄʀɪᴘᴛ ᴅᴇ █████▛▛▙▙▜▜▜▜▙▙▙▙▙▛▟            ▄▄▄▛█████
███████████████▜▚▛▛▟▞▛▛▛▙▙▙▙▙▙█▙           █▛█▜█▜████
█████████████▜▞▛▙▜▜▚▛▛▛█▟▟▟▟▟▚▙▛▖          ▛███▜█▜███
███████████▛▙▜▞▛▟▜▚▛▛▛▛▟▟▟▟▟▟▜▙▛▙          ▜█▟▛███▜▞█
██████████▜▟▞▙▜▜▞▙▛▛▟▜▜▚▙▙▙▙▛█▞▛▙▖          ▚███▟▛█▌▜
█████████▜▚▚▜▞▛▟▜▟▞▛▙▛▛█▟▟▟▟▜▟▜▛█▟▖          ▀▟▛▙██ ▐
████████▙▜▞▛▙▜▞▙▙▙▜▜▞▛▛▟▟▟▟▟▜▟▜▜▟▚▛▖           ▝▀▀   
███████▘▚▙▜▟▞▙▜▟▞▟▜▚▛▛▛▙▙▙▙▛█▟▛█▟▛▛▙▖               
██████▛▝▐▞▙▚▜▞▙▙▜▞▛▛▟▜▜▟▟▟▞█▟▟▜▙▙▛█▜▟▄              ▐
██████▘▚ ▛▞▛▙▜▞▞▙▛▛▟▜▜▙▙▙▙▛▙▙▛▙▙▛▛▙▛▙▛▌▖            ▟
█████▛▝▗▝▐▜▟▞▙▜▜▟▞▛▛▛▙▙▙▙▙▛▙▙▛█▟▜▜▙█▙▛█▜▄          ▞█
█████▌▚▗▝ ▙▚▜▞▛▙▙▜▜▜▟▚▙▙▙▙▛▙▛▛▙▛▛█▟▟▞█▟▜▟▟▄       ▞▛█
█████▘▖▗▝▗▝▛▙▜▟▞▟▜▚▛▟▜▟▟▟▞▛▙▛█▙▛█▚▙▙▛▙▛█▟▟▟▟▄▖ ▗▗▙▜▜█
█████▗ ▘▖▘▖▞▟▚▙▜▞▙▛▛▙█▟▟▞▛▛▙█▙▙▛▛▛▙▛▛▙█▟▟▟▟▟▟▟▜▟▜▟▜▜█
█████▗▝▗▗▗▗▝▝▙▙▜▜▞▛▟▙▙▙▙▛▛█▜▟▟▟▜▛█▙▛▛▙▙▙▙▙▙▙▙▜▜▟▜▟▜██
████▌▘▗▝ ▖▝▗▚▗▘▌▞▛▙▙▜▟▟▞█▜▟▟▙█▙█▜▟▟▜▟▜▜▟▚▙▙▙▛▛█▞█▞███
████▌▘▖▗▝▝▗▝▐▝▖▖▌▞▞▞▜▚▛▙▜▜▟▜▙▛▟▜▟▟▜▜▟▜▟▛▟▜▙▙█▞█▞▛▟███
████▌▖▗ ▖▘▗▝▖▌▚▚▐▝▞▞▌▌▀▀▜▜▟▜▟▜▜▜▟▜▜▜▟▛▙▛▙█▟▟▞█▞██████
████ ▖▗ ▖▗▗▝▞▖▚▝▖▌▞▖▌▚▚▘▌▌▌▌▌▞▞▞▞▗▘▀▀▀▗▗ ▖ ▗▝▟███████
████ ▖ ▖▗ ▗▚▗▐▝▞▝▖▚▐▝▞ ▘▘▘▘▗▗▗▗▗▗▗▝ ▘▖▖▖▘▖▚▄█████████
███▌▖ ▘ ▖▝▖▞▖▘▚▝▝▝▗ ▖ ▘▘▝ ▘▖▗ ▖▗ ▖▝▝▗▗▗▗▙▟███████████
███▌ ▖▖▘ ▖▞ ▝▝ ▖▘▝ ▖ ▘▝ ▘▘▘▗▗▗▗▗▗ ▚▐▄▟███████████████
███ ▖  ▗ ▖ ▝ ▖▘ ▖▘▗ ▘▘▘▘▝▗▝ ▖▗▗▄▄████████████████████
██▛ ▗▝ ▖ ▗▝ ▘ ▗ ▗▝ ▗▗▗▗▝▗▄▄▙█████████████████████████
██▌▝  ▗ ▝  ▖ ▘▗▝ ▗▟▄▄▟███████████████████████████████
██  ▖▝  ▖ ▘ ▙▟▟██████████████████████████████████████
█▌ ▘  ▖▙▄███████████████████████ ʟᴀᴄᴀᴘꜱᴜʟᴇ.ᴏʀɢ ██████
█  ▄▄████████████████████████████████████████████████
▙▟███████████████████████████████████████████████████" &&
echo "" &&
sleep 1 &&

echo "" 
echo "         $(tput setaf 0)$(tput setab 9) Début du script d'installation... $(tput sgr0)" &&
sleep 1 &&

echo ""
echo ""
echo ""
echo " $(tput setaf 0)$(tput setab 9) Veuillez entrer votre mot de passe administrateur $(tput sgr0)" &&
echo ""
sleep 1 &&

sudo apt update


echo ""
echo "        $(tput setaf 0)$(tput setab 9) Mise à jour de la liste des paquets $(tput sgr0)" &&
sleep 1 &&


echo ""
echo "                      ✅ OK ✅" &&
sleep 0.5 &&

echo ""
echo "         $(tput setaf 0)$(tput setab 9) Installation des nouveaux paquets $(tput sgr0)" &&
echo ""
sleep 1 &&

echo ""
echo "            $(tput setaf 0)$(tput setab 9) Installation de Google Chrome $(tput sgr0)" &&
echo ""
sleep 1 &&

echo "deb http://dl.google.com/linux/chrome/deb/ stable main"> /etc/apt/sources.list.d-chrome.list && 
wget -q -O - https: // dl-ssl .google.com / linux / linux_signing_key.pub | apt-key add  
sudo apt update && apt install google-chrome-stable

echo ""
echo "                      ✅ OK ✅" &&
sleep 0.5 &&

echo ""
echo "                      $(tput setaf 0)$(tput setab 9) Installation d'Opera $(tput sgr0)" &&
echo ""
sleep 1 &&

wget -qO - https://deb.opera.com/archive.key | sudo apt-key add -
sudo add-apt-repository 'deb https://deb.opera.com/opera-stable/ stable non-free'
sudo apt-get update
sudo apt install -V opera-stable

echo ""
echo "                      ✅ OK ✅" &&
sleep 0.5 &&

echo ""
echo "                         $(tput setaf 0)$(tput setab 9) Installation de Pix $(tput sgr0)" &&
echo ""
sleep 1 &&

sudo apt-get install pix

echo ""
echo "                      ✅ OK ✅" &&
sleep 0.5 &&

echo ""
echo ""
echo ""
echo "    $(tput setaf 1)$(tput setab 7) L'installation a été effectuée avec succès $(tput sgr0)" &&
sleep 0.5 &&

echo ""
echo ""
echo "                       👍👍👍"
sleep 4.5 &&
echo ""
echo ""

