#!/bin/bash

printf "\e[8;50;53t" &&
echo "
█████████████████████████████████████████████████████
█████████████████████▛▛▛▛▟▙▙▙▙▙▙▌▀▘        ▀▀▜███████
█ ꜱᴄʀɪᴘᴛ ᴅᴇ █████▛▛▙▙▜▜▜▜▙▙▙▙▙▛▟            ▄▄▄▛█████
███████████████▜▚▛▛▟▞▛▛▛▙▙▙▙▙▙█▙           █▛█▜█▜████
█████████████▜▞▛▙▜▜▚▛▛▛█▟▟▟▟▟▚▙▛▖          ▛███▜█▜███
███████████▛▙▜▞▛▟▜▚▛▛▛▛▟▟▟▟▟▟▜▙▛▙          ▜█▟▛███▜▞█
██████████▜▟▞▙▜▜▞▙▛▛▟▜▜▚▙▙▙▙▛█▞▛▙▖          ▚███▟▛█▌▜
█████████▜▚▚▜▞▛▟▜▟▞▛▙▛▛█▟▟▟▟▜▟▜▛█▟▖          ▀▟▛▙██ ▐
████████▙▜▞▛▙▜▞▙▙▙▜▜▞▛▛▟▟▟▟▟▜▟▜▜▟▚▛▖           ▝▀▀   
███████▘▚▙▜▟▞▙▜▟▞▟▜▚▛▛▛▙▙▙▙▛█▟▛█▟▛▛▙▖               
██████▛▝▐▞▙▚▜▞▙▙▜▞▛▛▟▜▜▟▟▟▞█▟▟▜▙▙▛█▜▟▄              ▐
██████▘▚ ▛▞▛▙▜▞▞▙▛▛▟▜▜▙▙▙▙▛▙▙▛▙▙▛▛▙▛▙▛▌▖            ▟
█████▛▝▗▝▐▜▟▞▙▜▜▟▞▛▛▛▙▙▙▙▙▛▙▙▛█▟▜▜▙█▙▛█▜▄          ▞█
█████▌▚▗▝ ▙▚▜▞▛▙▙▜▜▜▟▚▙▙▙▙▛▙▛▛▙▛▛█▟▟▞█▟▜▟▟▄       ▞▛█
█████▘▖▗▝▗▝▛▙▜▟▞▟▜▚▛▟▜▟▟▟▞▛▙▛█▙▛█▚▙▙▛▙▛█▟▟▟▟▄▖ ▗▗▙▜▜█
█████▗ ▘▖▘▖▞▟▚▙▜▞▙▛▛▙█▟▟▞▛▛▙█▙▙▛▛▛▙▛▛▙█▟▟▟▟▟▟▟▜▟▜▟▜▜█
█████▗▝▗▗▗▗▝▝▙▙▜▜▞▛▟▙▙▙▙▛▛█▜▟▟▟▜▛█▙▛▛▙▙▙▙▙▙▙▙▜▜▟▜▟▜██
████▌▘▗▝ ▖▝▗▚▗▘▌▞▛▙▙▜▟▟▞█▜▟▟▙█▙█▜▟▟▜▟▜▜▟▚▙▙▙▛▛█▞█▞███
████▌▘▖▗▝▝▗▝▐▝▖▖▌▞▞▞▜▚▛▙▜▜▟▜▙▛▟▜▟▟▜▜▟▜▟▛▟▜▙▙█▞█▞▛▟███
████▌▖▗ ▖▘▗▝▖▌▚▚▐▝▞▞▌▌▀▀▜▜▟▜▟▜▜▜▟▜▜▜▟▛▙▛▙█▟▟▞█▞██████
████ ▖▗ ▖▗▗▝▞▖▚▝▖▌▞▖▌▚▚▘▌▌▌▌▌▞▞▞▞▗▘▀▀▀▗▗ ▖ ▗▝▟███████
████ ▖ ▖▗ ▗▚▗▐▝▞▝▖▚▐▝▞ ▘▘▘▘▗▗▗▗▗▗▗▝ ▘▖▖▖▘▖▚▄█████████
███▌▖ ▘ ▖▝▖▞▖▘▚▝▝▝▗ ▖ ▘▘▝ ▘▖▗ ▖▗ ▖▝▝▗▗▗▗▙▟███████████
███▌ ▖▖▘ ▖▞ ▝▝ ▖▘▝ ▖ ▘▝ ▘▘▘▗▗▗▗▗▗ ▚▐▄▟███████████████
███ ▖  ▗ ▖ ▝ ▖▘ ▖▘▗ ▘▘▘▘▝▗▝ ▖▗▗▄▄████████████████████
██▛ ▗▝ ▖ ▗▝ ▘ ▗ ▗▝ ▗▗▗▗▝▗▄▄▙█████████████████████████
██▌▝  ▗ ▝  ▖ ▘▗▝ ▗▟▄▄▟███████████████████████████████
██  ▖▝  ▖ ▘ ▙▟▟██████████████████████████████████████
█▌ ▘  ▖▙▄███████████████████████ ʟᴀᴄᴀᴘꜱᴜʟᴇ.ᴏʀɢ ██████
█  ▄▄████████████████████████████████████████████████
▙▟███████████████████████████████████████████████████" &&
echo "" &&
sleep 1 &&

echo "         $(tput setaf 0)$(tput setab 9) Début du script de maintenance... $(tput sgr0)" &&
sleep 1 &&

echo "" 
echo "  $(tput setaf 0)$(tput setab 9) Obtention des droits sur les fichiers vérouillés $(tput sgr0)" &&
echo ""
sleep 1 &&

echo ""
echo " $(tput setaf 0)$(tput setab 9) Veuillez entrer votre mot de passe administrateur $(tput sgr0)" &&
echo ""
sleep 1 &&

sudo chown $USER -R /var/lib/dpkg/*
sudo chown $USER -R /var/cache/apt/*

echo ""
echo ""
echo "                      ✅ OK ✅" &&
sleep 0.5 &&

echo "" &&
echo "           $(tput setaf 0)$(tput setab 9) Réparation des paquets cassés $(tput sgr0)" &&
sleep 1 &&

echo "" &&

apt --fix-broken install &&

echo ""
echo "                      ✅ OK ✅" &&
sleep 0.5 &&

echo ""
echo "       $(tput setaf 0)$(tput setab 9) Autocomplétion des fichiers manquants $(tput sgr0)" &&
echo ""
sleep 1 &&

apt --fix-missing install &&

echo ""
echo "                      ✅ OK ✅" &&
sleep 0.5 &&

echo ""
echo "          $(tput setaf 0)$(tput setab 9) Chargement des nouveaux paquets $(tput sgr0)" &&
echo ""
sleep 1 &&
 
apt update &&

echo "" 
echo "                      ✅ OK ✅" &&
sleep 0.5 &&

echo ""
echo "$(tput setaf 0)$(tput setab 9) Téléchargement et installation des nouveaux paquets $(tput sgr0)" &&
echo ""
sleep 1 &&

apt upgrade -y &&

echo ""
echo "                      ✅ OK ✅" &&
sleep 0.5 &&

echo "" 
echo "             $(tput setaf 0)$(tput setab 9) Mise à niveau du système $(tput sgr0)" &&
echo ""
sleep 1 &&

apt full-upgrade -y &&

echo ""
echo "                      ✅ OK ✅" &&
sleep 0.5 &&

echo "" 
echo "             $(tput setaf 0)$(tput setab 9) Mise à jour de Linux Mint $(tput sgr0)" &&
echo ""
sleep 1 &&

mintupdate-cli upgrade -r -y &&

echo ""
echo "                      ✅ OK ✅" &&
sleep 0.5 &&

echo ""
echo "$(tput setaf 0)$(tput setab 9) Appuyer sur les touches ctrl+c pour annuler la purge$(tput sgr0)" &&
echo ""
sleep 10.5 &&

echo "" 
echo "             $(tput setaf 1)    !!! ATTENTION !!!  "
echo ""
echo "             $(tput setaf 0)$(tput setab 9) LA PURGE VA COMMENCER ! $(tput sgr0)" &&
sleep 4.5 &&

echo "" 
echo "                        $(tput setaf 1) ➎" &&
sleep 1 &&
echo "                         ➍" &&
sleep 1 &&
echo "                         ➌" &&
sleep 1 &&
echo "                         ➋" &&
sleep 1 &&
echo "                         ➊$(tput sgr0)" &&
sleep 1 &&

echo ""
echo ""
echo "         $(tput setaf 0)$(tput setab 9) Nettoyage du système de fichiers $(tput sgr0)" &&
echo "           "
sleep 1 &&

apt autoclean -y &&

echo ""
echo ""
echo "                      ✅ OK ✅" &&
sleep 0.5 &&

echo "" 
echo "         $(tput setaf 0)$(tput setab 9) Suppression des fichiers inutiles $(tput sgr0)" &&
echo ""
sleep 1 &&

apt autoremove -y &&

echo ""
echo ""
echo "                      ✅ OK ✅" &&
sleep 0.5 &&

echo ""
echo "             $(tput setaf 0)$(tput setab 9) Vidage du répertoire /tmp $(tput sgr0)" &&
echo "           "
sleep 1 &&

sudo rm -r ~/tmp/* &&

echo ""
echo ""
echo "                      ✅ OK ✅" &&
sleep 0.5 &&

echo ""
echo "              $(tput setaf 0)$(tput setab 9) Purge du cache système $(tput sgr0)" &&
echo ""
sleep 1 &&

sudo rm -r /home/$USER/.cache/* &&

echo ""
echo ""
echo "                      ✅ OK ✅" &&
sleep 0.5 &&

echo "" 
echo "  $(tput setaf 0)$(tput setab 9) Vidage des fichiers contenus dans la corbeille $(tput sgr0)" &&
echo ""
sleep 1 &&

sudo rm -r /home/$USER/.local/share/Trash/files/* &&

echo ""
echo ""
echo "                      ✅ OK ✅" &&
sleep 0.5 &&

echo "" 
echo "   $(tput setaf 0)$(tput setab 9) Vidage des informations de fichiers supprimés $(tput sgr0)" &&
echo ""
sleep 1 &&

sudo rm -r /home/$USER/.local/share/Trash/info/*

echo ""
echo "                      ✅ OK ✅" &&
sleep 0.5 &&

echo ""
echo ""
echo ""
echo "    $(tput setaf 1)$(tput setab 7) La maintenance a été effectuée avec succès $(tput sgr0)" &&
sleep 0.5 &&
echo ""
echo ""
echo "                       👍👍👍"
sleep 4.5 &&
echo ""
echo ""
